package org.example.blinov.glava6.candies;

/**
 * Разработать проект управления процессами на основе создания и
 * реализации интерфейсов для следующих предметных областей:
 * Конфеты. Возможности:
 * выпустить партию конфет;
 * получить информацию по продукции определенного производителя;
 * добавить и редактировать информацию о продукции;
 * добавить новые ингредиенты;
 * создать новый тип конфет;
 * снять с производства определенный тип конфет.
 * Добавить специализированные методы для Конфеты, Шоколад, Леденец, Ирис.
 */
public class Main {

    public static void main(String[] args) {

    }
}
